ss1969/EdgeTx-AT32F435EVB/project/src/main.c
/* add user code begin Header */
/**
  **************************************************************************
  * @file     main.c
  * @brief    main program
  **************************************************************************
  * Copyright (c) 2025, Artery Technology, All rights reserved.
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */
/* add user code end Header */

/* Includes ------------------------------------------------------------------*/
#include "at32f435_437_wk_config.h"
#include "wk_acc.h"
#include "wk_exint.h"
#include "wk_qspi.h"
#include "wk_spi.h"
#include "wk_usart.h"
#include "wk_usb_otgfs.h"
#include "wk_edma.h"
#include "wk_gpio.h"
#include "wk_system.h"

/* private includes ----------------------------------------------------------*/
/* add user code begin private includes */
#include "aps6404l.h"
#include "qspi2_lcd_bus.h"
#include "txw430038b0_nv3041a_01.h"
#include "uart3_printf.h"
#include <stdlib.h>
/* add user code end private includes */

/* private typedef -----------------------------------------------------------*/
/* add user code begin private typedef */

/* add user code end private typedef */

/* private define ------------------------------------------------------------*/
/* add user code begin private define */
#define APS6404L_TEST_TOTAL_BYTES         (1U * 1024U * 1024U)
#define APS6404L_TEST_CHUNK_SIZE          (8U * 1024U)
#define APS6404L_TEST_PROGRESS_STEP       (256U * 1024U)

#define APS6404L_BENCH_TOTAL_BYTES        (256U * 1024U)
#define APS6404L_BENCH_CHUNK_BYTES        (64U * 1024U)

/* add user code end private define */

/* private macro -------------------------------------------------------------*/
/* add user code begin private macro */

/* add user code end private macro */

/* private variables ---------------------------------------------------------*/
/* add user code begin private variables */

/* add user code end private variables */

/* private function prototypes --------------------------------------------*/
/* add user code begin function prototypes */

/* add user code end function prototypes */

/* private user code ---------------------------------------------------------*/
/* add user code begin 0 */
static void aps_perf_init(void)
{
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CYCCNT = 0;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static uint32_t aps_perf_cycles(void)
{
  return DWT->CYCCNT;
}

static void aps_print_speed(const char *tag, uint32_t bytes, uint32_t cycles)
{
  uint64_t bps64;
  uint32_t mib_x10;

  if(cycles == 0U)
  {
    UART3_Printf("%s: cycles=0\r\n", tag);
    return;
  }

  bps64 = ((uint64_t)bytes * (uint64_t)SystemCoreClock) / (uint64_t)cycles;
  mib_x10 = (uint32_t)((bps64 * 10ULL) / (1024ULL * 1024ULL));

  UART3_Printf("%s: bytes=%lu cycles=%lu speed=%lu.%lu MiB/s\r\n",
               tag,
               (unsigned long)bytes,
               (unsigned long)cycles,
               (unsigned long)(mib_x10 / 10U),
               (unsigned long)(mib_x10 % 10U));
}

static inline void spi1_lcd_cs_low(void)
{
  gpio_bits_reset(SPI1_CS_GPIO_PORT, SPI1_CS_PIN);
}

static inline void spi1_lcd_cs_high(void)
{
  gpio_bits_set(SPI1_CS_GPIO_PORT, SPI1_CS_PIN);
}

static inline void spi1_lcd_dcx_cmd(void)
{
  gpio_bits_reset(SPI1_DCX_GPIO_PORT, SPI1_DCX_PIN);
}

static inline void spi1_lcd_dcx_data(void)
{
  gpio_bits_set(SPI1_DCX_GPIO_PORT, SPI1_DCX_PIN);
}

static int spi1_wait_flag_set(uint32_t flag, uint32_t timeout)
{
  while(spi_i2s_flag_get(SPI1, flag) == RESET)
  {
    if(timeout-- == 0U)
    {
      return 0;
    }
  }
  return 1;
}

static int spi1_wait_flag_reset(uint32_t flag, uint32_t timeout)
{
  while(spi_i2s_flag_get(SPI1, flag) == SET)
  {
    if(timeout-- == 0U)
    {
      return 0;
    }
  }
  return 1;
}

static int spi1_xfer8(uint8_t tx, uint8_t *rx)
{
  if(!spi1_wait_flag_set(SPI_I2S_TDBE_FLAG, 2000000U))
  {
    return 0;
  }
  spi_i2s_data_transmit(SPI1, tx);
  if(!spi1_wait_flag_set(SPI_I2S_RDBF_FLAG, 2000000U))
  {
    return 0;
  }
  if(rx != 0)
  {
    *rx = (uint8_t)spi_i2s_data_receive(SPI1);
  }
  else
  {
    (void)spi_i2s_data_receive(SPI1);
  }
  return 1;
}

static int spi1_lcd_read_reg(uint8_t cmd, uint8_t *out, uint32_t out_len, uint32_t dummy_bytes)
{
  uint32_t i;
  uint8_t tmp;

  spi_half_duplex_direction_set(SPI1, SPI_HALF_DUPLEX_DIRECTION_TX);
  spi1_lcd_cs_low();
  spi1_lcd_dcx_cmd();
  if(!spi1_xfer8(cmd, 0))
  {
    spi1_lcd_cs_high();
    return 0;
  }

  spi1_lcd_dcx_data();
  spi_half_duplex_direction_set(SPI1, SPI_HALF_DUPLEX_DIRECTION_RX);

  for(i = 0; i < dummy_bytes; i++)
  {
    if(!spi1_xfer8(0x00, &tmp))
    {
      spi_half_duplex_direction_set(SPI1, SPI_HALF_DUPLEX_DIRECTION_TX);
      spi1_lcd_cs_high();
      return 0;
    }
  }

  for(i = 0; i < out_len; i++)
  {
    if(!spi1_xfer8(0x00, &out[i]))
    {
      spi_half_duplex_direction_set(SPI1, SPI_HALF_DUPLEX_DIRECTION_TX);
      spi1_lcd_cs_high();
      return 0;
    }
  }

  if(!spi1_wait_flag_reset(SPI_I2S_BF_FLAG, 2000000U))
  {
    spi_half_duplex_direction_set(SPI1, SPI_HALF_DUPLEX_DIRECTION_TX);
    spi1_lcd_cs_high();
    return 0;
  }

