ss1969/EdgeTx-AT32F435EVB/project/src/main.c
  spi_half_duplex_direction_set(SPI1, SPI_HALF_DUPLEX_DIRECTION_TX);
  spi1_lcd_cs_high();
  return 1;
}
/* add user code end 0 */

/**
  * @brief main function.
  * @param  none
  * @retval none
  */
int main(void)
{
  /* add user code begin 1 */

  /* add user code end 1 */

  /* system clock config. */
  wk_system_clock_config();

  /* config periph clock. */
  wk_periph_clock_config();

  /* nvic config. */
  wk_nvic_config();

  /* timebase config for
     void wk_delay_us(uint32_t delay);
     void wk_delay_ms(uint32_t delay); */
  wk_timebase_init();

  /* init gpio function. */
  wk_gpio_config();

  /* init edma stream1 */
  wk_edma_stream1_init();
  /* config edma stream transfer parameter */
  /* user need to modify define values EDMA_STREAMx_XXX_BASE_ADDR 
     and EDMA_STREAMx_BUFFER_SIZE in at32xxx_wk_config.h */
  wk_edma_stream_config(EDMA_STREAM1, 
                        (uint32_t)&QSPI1->dt, 
                        EDMA_STREAM1_MEMORY0_BASE_ADDR, 
                        EDMA_STREAM1_BUFFER_SIZE);
  /* enable stream */
  edma_stream_enable(EDMA_STREAM1, TRUE);

  /* init usart1 function. */
  wk_usart1_init();

  /* init usart2 function. */
  wk_usart2_init();

  /* init usart3 function. */
  wk_usart3_init();

  /* init acc function. */
  wk_acc_init();

  /* init usb_otgfs1 function. */
  wk_usb_otgfs1_init();

  /* init spi1 function. */
  wk_spi1_init();

  /* init qspi1 function. */
  wk_qspi1_init();

  /* init qspi2 function. */
  wk_qspi2_init();

  /* init exint function. */
  wk_exint_config();

  /* add user code begin 2 */
  unsigned char id[8];
  int i;

  UART3_Printf("\x1b[2J\x1b[H");
  UART3_Printf("start up\r\n");

  /* add user code end 2 */

  while(1)
  {
    /* add user code begin 3 */
    static unsigned char ran = 0;

    if(!ran)
    {
#if 0
      int ok;
      unsigned char *write_buf;
      volatile unsigned char *psram = (volatile unsigned char *)APS6404L_MEM_BASE;
      unsigned int addr;
      unsigned int fail_addr = 0;
      unsigned int offset;
      unsigned char pass = 1;
      unsigned char fail_index = 0;
      unsigned char fail_exp = 0;
      unsigned char fail_got = 0;
      unsigned int seed;
      unsigned int chunk_len;
      unsigned char used_malloc = 0;
      static unsigned char write_buf_fallback[APS6404L_TEST_CHUNK_SIZE];

      for(i = 0; i < (int)sizeof(id); i++)
      {
        id[i] = 0;
      }

      PSRAM_Reset();
      ok = PSRAM_ReadID(id, (int)sizeof(id));

      UART3_Printf("APS RDID:");
      for(i = 0; i < (int)sizeof(id); i++)
      {
        UART3_PrintHexByte(id[i]);
      }
      UART3_Printf("\r\n");

      if(ok)
      {
        unsigned char all_ff = 1;
        for(i = 0; i < (int)sizeof(id); i++)
        {
          if(id[i] != 0xFF)
          {
            all_ff = 0;
            break;
          }
        }
        if(all_ff)
        {
          ok = 0;
        }
      }

      if(!ok)
      {
        UART3_Printf("APS RDID: FAIL\r\n");
      }

      {
        unsigned char qpi_w[32];
        unsigned char qpi_r[32];
        unsigned char qpi_pass = 1;
        unsigned char qpi_fail_index = 0;

        for(i = 0; i < (int)sizeof(qpi_w); i++)
        {
          qpi_w[i] = (unsigned char)(0xA0 + i);
          qpi_r[i] = 0;
        }

        UART3_Printf("APS QPI FAST: START\r\n");
        if(!PSRAM_EnterQuadMode())
        {
          UART3_Printf("APS QPI FAST: ENTER FAIL\r\n");
        }
        else
        {
          if(!PSRAM_QPI_FastWrite(0, qpi_w, (int)sizeof(qpi_w)))
          {
            UART3_Printf("APS QPI FAST: W FAIL\r\n");
          }
          else if(!PSRAM_QPI_FastRead(0, qpi_r, (int)sizeof(qpi_r)))
          {
            UART3_Printf("APS QPI FAST: R FAIL\r\n");
          }
          else
          {
            for(i = 0; i < (int)sizeof(qpi_w); i++)
            {
              if(qpi_w[i] != qpi_r[i])
              {
                qpi_pass = 0;
                qpi_fail_index = (unsigned char)i;
                break;
              }
            }

            if(qpi_pass)
            {
              UART3_Printf("APS QPI FAST: OK\r\n");
            }
            else
            {
              UART3_Printf("APS QPI FAST: FAIL idx=");
              UART3_PrintHexByte(qpi_fail_index);
              UART3_Printf(" exp=");
              UART3_PrintHexByte(qpi_w[qpi_fail_index]);
              UART3_Printf(" got=");
              UART3_PrintHexByte(qpi_r[qpi_fail_index]);
              UART3_Printf("\r\n");
            }
          }

          if(!PSRAM_ExitQuadMode())
          {
            UART3_Printf("APS QPI FAST: EXIT FAIL\r\n");
          }
        }
      }

      PSRAM_Reset();

      {
        static uint32_t bench_w_u32[APS6404L_BENCH_CHUNK_BYTES / 4U];
        static uint32_t bench_r_u32[APS6404L_BENCH_CHUNK_BYTES / 4U];
        unsigned char *bench_w = (unsigned char *)bench_w_u32;
        unsigned char *bench_r = (unsigned char *)bench_r_u32;
        uint32_t t0;
        uint32_t t1;
        uint32_t off;
        uint32_t sum;
        uint32_t base = 0x00100000u;
        int bench_ok = 1;

        aps_perf_init();

        for(i = 0; i < (int)APS6404L_BENCH_CHUNK_BYTES; i++)
        {
          bench_w[i] = (unsigned char)(0xC3u ^ (unsigned char)i);
          bench_r[i] = 0;
        }

        UART3_Printf("APS BENCH: total=");
        UART3_PrintHexU32(APS6404L_BENCH_TOTAL_BYTES);
        UART3_Printf(" chunk=");
        UART3_PrintHexU32(APS6404L_BENCH_CHUNK_BYTES);
        UART3_Printf("\r\n");

        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_QPI_Write(base + off, bench_w, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH WR 111", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
        }
        else
        {
          UART3_Printf("APS BENCH WR 111: FAIL\r\n");
        }

        sum = 0;
        bench_ok = 1;
        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_QPI_Read(base + off, bench_r, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
          for(i = 0; i < 16; i++)
          {
            sum ^= (uint32_t)bench_r[i];
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH RD 111", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
          UART3_Printf("APS BENCH RD 111: sum=");
          UART3_PrintHexU32(sum);
          UART3_Printf("\r\n");
        }
        else
        {
          UART3_Printf("APS BENCH RD 111: FAIL\r\n");
        }

        if(PSRAM_EnterQuadMode())
        {
          bench_ok = 1;
          t0 = aps_perf_cycles();
          for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
          {
            if(!PSRAM_QPI_FastWrite(base + off, bench_w, (int)APS6404L_BENCH_CHUNK_BYTES))
            {
              bench_ok = 0;
              break;
            }
          }
          t1 = aps_perf_cycles();
          if(bench_ok)
          {
            aps_print_speed("APS BENCH WR 444", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
          }
          else
          {
          UART3_Printf("APS BENCH WR 444: FAIL\r\n");
          }

          sum = 0;
          bench_ok = 1;
          t0 = aps_perf_cycles();
          for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
          {
            if(!PSRAM_QPI_FastRead(base + off, bench_r, (int)APS6404L_BENCH_CHUNK_BYTES))
            {
              bench_ok = 0;
              break;
            }
            for(i = 0; i < 16; i++)
            {
              sum ^= (uint32_t)bench_r[i];
            }
          }
          t1 = aps_perf_cycles();
          if(bench_ok)
          {
            aps_print_speed("APS BENCH RD 444", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
            UART3_Printf("APS BENCH RD 444: sum=");
            UART3_PrintHexU32(sum);
            UART3_Printf("\r\n");
          }
          else
          {
          UART3_Printf("APS BENCH RD 444: FAIL\r\n");
          }

