ss1969/EdgeTx-AT32F435EVB/project/src/main.c
          if(!PSRAM_ExitQuadMode())
          {
            UART3_Printf("APS BENCH: EXIT QPI FAIL\r\n");
          }
        }
        else
        {
          UART3_Printf("APS BENCH: ENTER QPI FAIL\r\n");
        }

        bench_ok = 1;
        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_EDMA_Write(base + off, bench_w, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH WR EDMA", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
        }
        else
        {
          UART3_Printf("APS BENCH WR EDMA: FAIL\r\n");
        }

        sum = 0;
        bench_ok = 1;
        t0 = aps_perf_cycles();
        for(off = 0; off < APS6404L_BENCH_TOTAL_BYTES; off += APS6404L_BENCH_CHUNK_BYTES)
        {
          if(!PSRAM_EDMA_Read(base + off, bench_r, (int)APS6404L_BENCH_CHUNK_BYTES))
          {
            bench_ok = 0;
            break;
          }
          for(i = 0; i < 16; i++)
          {
            sum ^= (uint32_t)bench_r[i];
          }
        }
        t1 = aps_perf_cycles();
        if(bench_ok)
        {
          aps_print_speed("APS BENCH RD EDMA", APS6404L_BENCH_TOTAL_BYTES, t1 - t0);
          UART3_Printf("APS BENCH RD EDMA: sum=");
          UART3_PrintHexU32(sum);
          UART3_Printf("\r\n");
        }
        else
        {
          UART3_Printf("APS BENCH RD EDMA: FAIL\r\n");
        }
      }

      {
        static uint32_t edma_w_u32[256];
        static uint32_t edma_r_u32[256];
        unsigned char edma_pass = 1;
        unsigned char edma_fail_index = 0;
        unsigned int edma_len = (unsigned int)sizeof(edma_w_u32);
        unsigned char *edma_w = (unsigned char *)edma_w_u32;
        unsigned char *edma_r = (unsigned char *)edma_r_u32;

        for(i = 0; i < (int)edma_len; i++)
        {
          edma_w[i] = (unsigned char)(0x55u ^ (unsigned char)i);
          edma_r[i] = 0;
        }

        UART3_Printf("APS EDMA RW: START len=");
        UART3_PrintHexU32(edma_len);
        UART3_Printf("\r\n");

        if(!PSRAM_EDMA_Write(0x00001000u, edma_w, (int)edma_len))
        {
          UART3_Printf("APS EDMA RW: W FAIL\r\n");
        }
        else if(!PSRAM_EDMA_Read(0x00001000u, edma_r, (int)edma_len))
        {
          UART3_Printf("APS EDMA RW: R FAIL\r\n");
        }
        else
        {
          for(i = 0; i < (int)edma_len; i++)
          {
            if(edma_w[i] != edma_r[i])
            {
              edma_pass = 0;
              edma_fail_index = (unsigned char)i;
              break;
            }
          }

          if(edma_pass)
          {
            UART3_Printf("APS EDMA RW: OK\r\n");
          }
          else
          {
            UART3_Printf("APS EDMA RW: FAIL idx=");
            UART3_PrintHexByte(edma_fail_index);
            UART3_Printf(" exp=");
            UART3_PrintHexByte(edma_w[edma_fail_index]);
            UART3_Printf(" got=");
            UART3_PrintHexByte(edma_r[edma_fail_index]);
            UART3_Printf("\r\n");
          }
        }
      }

      UART3_Printf("APS RW 1MB: START\r\n");

      write_buf = (unsigned char *)malloc(APS6404L_TEST_CHUNK_SIZE);
      if(write_buf == 0)
      {
        write_buf = write_buf_fallback;
        UART3_Printf("APS RW 1MB: MALLOC FAIL, USE STATIC\r\n");
      }
      else
      {
        used_malloc = 1;
      }

      addr = 0;
      for(offset = 0; offset < APS6404L_TEST_TOTAL_BYTES; offset += APS6404L_TEST_CHUNK_SIZE)
      {
        if((offset % APS6404L_TEST_PROGRESS_STEP) == 0U)
        {
          UART3_Printf("off=");
          UART3_PrintHexU32(offset);
          UART3_Printf("\r\n");
        }

        chunk_len = APS6404L_TEST_CHUNK_SIZE;
        if((APS6404L_TEST_TOTAL_BYTES - offset) < chunk_len)
        {
          chunk_len = APS6404L_TEST_TOTAL_BYTES - offset;
        }

        seed = 0x6D2B79F5u ^ (addr + offset);
        for(i = 0; i < (int)chunk_len; i++)
        {
          seed ^= seed << 13;
          seed ^= seed >> 17;
          seed ^= seed << 5;
          write_buf[i] = (unsigned char)(seed & 0xFFu);
        }

        for(i = 0; i < (int)chunk_len; i++)
        {
          psram[addr + offset + (unsigned int)i] = write_buf[i];
        }

        __DSB();
        __ISB();

        for(i = 0; i < (int)chunk_len; i++)
        {
          unsigned char got = psram[addr + offset + (unsigned int)i];
          if(write_buf[i] != got)
          {
            pass = 0;
            fail_addr = addr + offset;
            fail_index = (unsigned char)i;
            fail_exp = write_buf[i];
            fail_got = got;
            break;
          }
        }

        if(!pass)
        {
          break;
        }
      }

      if(used_malloc)
      {
        free(write_buf);
      }

      if(pass)
      {
        UART3_Printf("APS RW 1MB: OK\r\n");
      }
      else
      {
        UART3_Printf("APS RW 1MB: FAIL addr=");
        UART3_PrintHexU32(fail_addr);
        UART3_Printf(" idx=");
        UART3_PrintHexByte(fail_index);
        UART3_Printf(" exp=");
        UART3_PrintHexByte(fail_exp);
        UART3_Printf(" got=");
        UART3_PrintHexByte(fail_got);
        UART3_Printf("\r\n");
        for(i = 0; i < 16; i++)
        {
          UART3_PrintHexByte(psram[fail_addr + (unsigned int)i]);
        }
        UART3_Printf("\r\n");
      }

      ran = 1;
#endif

      {
        uint8_t rd04_d0[3];
        uint8_t rd04_d1[3];
        uint8_t id_da_d0;
        uint8_t id_da_d1;
        uint8_t id_db_d0;
        uint8_t id_db_d1;
        uint8_t id_dc_d0;
        uint8_t id_dc_d1;
        int ok04_d0;
        int ok04_d1;
        int okda_d0;
        int okda_d1;
        int okdb_d0;
        int okdb_d1;
        int okdc_d0;
        int okdc_d1;

        rd04_d0[0] = 0;
        rd04_d0[1] = 0;
        rd04_d0[2] = 0;
        rd04_d1[0] = 0;
        rd04_d1[1] = 0;
        rd04_d1[2] = 0;
        id_da_d0 = 0;
        id_da_d1 = 0;
        id_db_d0 = 0;
        id_db_d1 = 0;
        id_dc_d0 = 0;
        id_dc_d1 = 0;

