ss1969/EdgeTx-AT32F435EVB/project/src/main.c
        spi1_lcd_cs_high();
        gpio_bits_reset(QSPI2_RESET_GPIO_PORT, QSPI2_RESET_PIN);
        wk_delay_ms(20);
        gpio_bits_set(QSPI2_RESET_GPIO_PORT, QSPI2_RESET_PIN);
        wk_delay_ms(20);

        ok04_d0 = spi1_lcd_read_reg(0x04, rd04_d0, 3, 0);
        ok04_d1 = spi1_lcd_read_reg(0x04, rd04_d1, 3, 1);

        okda_d0 = spi1_lcd_read_reg(0xDA, &id_da_d0, 1, 0);
        okda_d1 = spi1_lcd_read_reg(0xDA, &id_da_d1, 1, 1);
        okdb_d0 = spi1_lcd_read_reg(0xDB, &id_db_d0, 1, 0);
        okdb_d1 = spi1_lcd_read_reg(0xDB, &id_db_d1, 1, 1);
        okdc_d0 = spi1_lcd_read_reg(0xDC, &id_dc_d0, 1, 0);
        okdc_d1 = spi1_lcd_read_reg(0xDC, &id_dc_d1, 1, 1);

        UART3_Printf("SPI1: RD04 d0 ok=%d data=", ok04_d0);
        UART3_PrintHexByte(rd04_d0[0]);
        UART3_PrintHexByte(rd04_d0[1]);
        UART3_PrintHexByte(rd04_d0[2]);
        UART3_Printf("\r\n");
        UART3_Printf("SPI1: RD04 d1 ok=%d data=", ok04_d1);
        UART3_PrintHexByte(rd04_d1[0]);
        UART3_PrintHexByte(rd04_d1[1]);
        UART3_PrintHexByte(rd04_d1[2]);
        UART3_Printf("\r\n");

        UART3_Printf("SPI1: RDDA d0 ok=%d data=", okda_d0);
        UART3_PrintHexByte(id_da_d0);
        UART3_Printf("  d1 ok=%d data=", okda_d1);
        UART3_PrintHexByte(id_da_d1);
        UART3_Printf("\r\n");
        UART3_Printf("SPI1: RDDB d0 ok=%d data=", okdb_d0);
        UART3_PrintHexByte(id_db_d0);
        UART3_Printf("  d1 ok=%d data=", okdb_d1);
        UART3_PrintHexByte(id_db_d1);
        UART3_Printf("\r\n");
        UART3_Printf("SPI1: RDDC d0 ok=%d data=", okdc_d0);
        UART3_PrintHexByte(id_dc_d0);
        UART3_Printf("  d1 ok=%d data=", okdc_d1);
        UART3_PrintHexByte(id_dc_d1);
        UART3_Printf("\r\n");
      }

#if 0
      UART3_Printf("LCD: %s init\r\n", txw430038b0_nv3041a_01_name());
      if(!txw430038b0_nv3041a_01_init())
      {
        qspi_operate_mode_type modes[3];
        int mi;

        UART3_Printf("LCD: init FAIL opmode=");
        UART3_PrintHexU32((uint32_t)qspi2_lcd_bus_opmode_get());
        UART3_Printf(" bus_err=");
        UART3_PrintHexU32((uint32_t)qspi2_lcd_bus_last_error_get());
        UART3_Printf(" ctrl=");
        UART3_PrintHexU32(QSPI2->ctrl);
        UART3_Printf(" fifosts=");
        UART3_PrintHexU32(QSPI2->fifosts);
        UART3_Printf(" cmdsts=");
        UART3_PrintHexU32(QSPI2->cmdsts);
        UART3_Printf("\r\n");

        modes[0] = QSPI_OPERATE_MODE_114;
        modes[1] = QSPI_OPERATE_MODE_144;
        modes[2] = QSPI_OPERATE_MODE_444;

        for(mi = 0; mi < 3; mi++)
        {
          qspi2_lcd_bus_opmode_set(modes[mi]);
          UART3_Printf("LCD: retry opmode=");
          UART3_PrintHexU32((uint32_t)modes[mi]);
          UART3_Printf("\r\n");
          if(txw430038b0_nv3041a_01_init())
          {
            UART3_Printf("LCD: init OK opmode=");
            UART3_PrintHexU32((uint32_t)modes[mi]);
            UART3_Printf("\r\n");
            break;
          }
        }
      }
      else
      {
        static uint16_t line[TXW430038B0_WIDTH];
        uint32_t x;
        uint32_t y;

        qspi2_lcd_bus_wait_te_rise(2000000U);

        for(y = 0; y < TXW430038B0_HEIGHT; y++)
        {
          for(x = 0; x < TXW430038B0_WIDTH; x++)
          {
            uint32_t bar = (x * 8U) / TXW430038B0_WIDTH;
            uint16_t color;

            switch(bar)
            {
              case 0U: color = 0xF800U; break;
              case 1U: color = 0x07E0U; break;
              case 2U: color = 0x001FU; break;
              case 3U: color = 0x07FFU; break;
              case 4U: color = 0xF81FU; break;
              case 5U: color = 0xFFE0U; break;
              case 6U: color = 0xFFFFU; break;
              default: color = 0x0000U; break;
            }

            line[x] = color;
          }

          if(!txw430038b0_nv3041a_01_set_window(0, (uint16_t)y, (uint16_t)(TXW430038B0_WIDTH - 1U), (uint16_t)y))
          {
            UART3_Printf("LCD: set_window FAIL y=");
            UART3_PrintHexU32(y);
            UART3_Printf("\r\n");
            break;
          }
          if(!txw430038b0_nv3041a_01_write_pixels_rgb565(line, TXW430038B0_WIDTH))
          {
            UART3_Printf("LCD: write FAIL y=");
            UART3_PrintHexU32(y);
            UART3_Printf("\r\n");
            break;
          }
        }

        UART3_Printf("LCD: test done\r\n");
      }
#endif

      ran = 1;
    }

    wk_delay_ms(1000);

    /* add user code end 3 */
  }
}

  /* add user code begin 4 */

  /* add user code end 4 */
